{
  "actionChainID": 421613,
  "actionAddress": "0x85792f6BF346e3Bfd3A275318aDd2c44A1058447",
  "description": "\nProposal: Update Security Council Election Start Date to Ensure Time for Security Audit\n\nCategory: Constitutional - Process\n\nHigh Level Overview\nThe ArbitrumDAO Constitution specifies that the first Security Council election should start on the 15th September alongside a specification for the election.\n\nAn on-chain implementation of the entire election is still a work in progress. The Arbitrum Foundation has sponsored the implementation of a smart contract suite by Offchain Labs, an extension of Tally’s user interface, and the respective audits.\n\nThis proposal seeks to revise the ArbitrumDAO Constitution to provide flexibility for the start date of the election. If passed by a Constitutional Vote, the new start date will be on the 15th September or the earliest possible date in which an on-chain election can begin.\n\nThe motivation to change the election’s start date is to provide time for the implementation to be completed, security audits to be performed, for the community to gain confidence in the quality of its implementation and for the Arbitrum DAO to vote on a separate Constitutional AIP to install an on-chain election system.\n\nThe overarching goal is to still allow the election to begin on the 15th September, but it is prudent to provide leeway and ensure all parties, especially the Arbitrum DAO, are confident in the election software’s security and completeness.\n\nPath to a Smart Contract Enabled Election\nThis proposal seeks approval from the Arbitrum DAO that the first and all subsequent security elections should be performed via the on-chain election process.\n\nThe activation of the Security Council election is dependent on:\n\nComplete implementation for the on-chain smart contracts,\nComplete implementation of the user interface,\nSmart contract audit by a highly regarded auditing firm,\nAll parties, including the Arbitrum DAO, have gained confidence in the implementation’s completeness and security,\nSuccessful Constitutional Vote by the DAO to install the new election software.\nA vote on this proposal is approving that the above conditions are mandatory for any election software before it can be installed into the on-chain smart contracts.\n\nModified Start Date for Election\nThe implementation sponsored by the Arbitrum Foundation should be ready for the start date of the 15th September.\n\nEven so, given the naunces of implementation details and the potential security risks to a critical part of the system, we believe it is still prudent to provide leeway and extra time for the Security Council elections to begin some time after the required date set out by The Arbitrum Foundation.\n\nAfter all, it is not just about having a complete implementation, but ensuring all parties have confidence that all efforts have made been to minimize the risk of bugs in the implementation.\n\nRevision to ArbitrumDAO Constitution\nThe revised text focuses on the election beginning at the earliest possible date from the 15th September. Additionally, the election can only begin once an on-chain election system is installed via a separate Constitutional Vote.\n\nAll future elections can begin six months after the previous election. As such, the chosen date for the first election will decide the earliest start date for the next election.\n\nFor extra clarity in the text, we have renamed “September Cohort” to “First Cohort” and “March Cohort” to “Second Cohort”\n\nFinally, to remove any ambiguity, all security council members are expected to serve the time until the new Security Council members are installed in the respective smart contracts.\n\nCurrent text of ArbitrumDAO Constitution:\nThe Security Council has 12 members, who are divided into a September Cohort of 6 members, and a March Cohort of 6 members. Every year on September 15, 12:00 UTC, an election starts for the 6 September Cohort seats; and every year on March 15, 12:00 UTC, an election starts for the 6 March Cohort seats.\n\nThis means that the initial September Cohort will serve an initial term of 6 months, whereas the initial March Cohort will serve an initial term of 1 year.\n\nThe initial Security Council Cohorts were determined by randomly splitting the 12 members into two 6-member cohorts - 6 members in the September Cohort and 6 members in the March Cohort. The members of the initial Security Council Cohorts are detailed in a transparency report here.\n\nProposed Revision of Arbitrum Constitution:\nThe Security Council has 12 members, who are divided into two Cohorts of 6 members.\n\nThe initial Security Council Cohorts were determined by randomly splitting the 12 members into two 6-member cohorts - 6 members in the ‘First Cohort’ and 6 members in the ‘Second Cohort’. The members of the initial Security Council Cohorts are detailed in a transparency report here.\n\nThe first security election is scheduled to begin on the 15th September 2023 or the earliest possible date. The election can only begin upon the availability of an on-chain election process that was approved and installed by the Arbitrum DAO. This first election replaces the ‘First Cohort’. The next election replaces the ‘Second Cohort,’ and so forth.\n\nThe date chosen for the first election will form the basis for all future elections. Every election should begin 6 months after the previous election has started and it will replace its respective cohort of 6 members.\n\nAll Security Council members are expected to serve their term until the election is complete and the new Security Council members are installed.\n",
  "arbSysSendTxToL1Args": {
    "l1Timelock": "0x364188EcF8E0733cB90d8EbeD90d56E56205dDfE",
    "calldata": "0x01d5062a000000000000000000000000a723c008e76e379c55599d2e4d93879beafda79c000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000c000000000000000000000000000000000000000000000000000000000000000004508d56e2b8cb6f9dad5f2e980f1abab0d96f7d0f4c5d924ae3fd9e9d98ac6d2000000000000000000000000000000000000000000000000000000000000038400000000000000000000000000000000000000000000000000000000000001800000000000000000000000006bebc4925716945d46f0ec336d5c2564f419682c00000000000000000000000067acb531a05160a81dcd03079347f264c4fa2da300000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000c000000000000000000000000000000000000000000000000000000000000000841cff79cd00000000000000000000000085792f6bf346e3bfd3a275318add2c44a105844700000000000000000000000000000000000000000000000000000000000000400000000000000000000000000000000000000000000000000000000000000004b147f40c0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000"
  }
}